RorFormation/app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `posts`.`title` = 'Je m\'apelle matis', `posts`.`content` = 'Jaime le caca' WHERE `posts`.`id` = 1
---
  def update
    @post = Post.find(params[:id])
    post_params = params.require(:post).permit(:title, :content)
    @post.update(post_params)

INSERT INTO `posts` (`title`, `content`) VALUES ('ezfz', 'zef')
---
  def create
    post = Post.create(post_params)